Test

```

stdout<<ghadelimiter_e2d7b9ba-af80-4b96-8ee1-10d908886ef3

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

ghadelimiter_e2d7b9ba-af80-4b96-8ee1-10d908886ef3
stderr<<ghadelimiter_c1e6acb4-ce75-4317-a9b5-69dd8c3fb166

ghadelimiter_c1e6acb4-ce75-4317-a9b5-69dd8c3fb166
exitcode<<ghadelimiter_3191a753-3f57-4b23-a412-a1ac40adcc58
0
ghadelimiter_3191a753-3f57-4b23-a412-a1ac40adcc58
Plan: 1 to add, 0 to change, 0 to destroy.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
```
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Security 🛡️ `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/2c605bff-31f6-4575-bf54-1ad6b59a0df6/terraform-bin plan -no-color -out tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_b7048aa4-bfbf-4019-8b0a-ef367e0af092

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_b7048aa4-bfbf-4019-8b0a-ef367e0af092
stderr<<ghadelimiter_500306bf-2924-41ef-bd94-50d339cf1ad1

ghadelimiter_500306bf-2924-41ef-bd94-50d339cf1ad1
exitcode<<ghadelimiter_33a7fa00-7a43-4724-b2a4-24ff72ed4cfd
0
ghadelimiter_33a7fa00-7a43-4724-b2a4-24ff72ed4cfd
```
</details>

*Pusher: @dawidmalina, Action: `pull_request`, Working Directory: `gcp/prod/global`, Workflow: `Terraform`*